Assignment 3/JMeter/test_1.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="test_1" enabled="true">
      <stringProp name="TestPlan.comments">This test plan was created by the BlazeMeter converter v.2.3.17. Please contact support@blazemeter.com for further support.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Accept" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">*/*</stringProp>
          </elementProp>
          <elementProp name="User-Agent" elementType="Header">
            <stringProp name="Header.name">User-Agent</stringProp>
            <stringProp name="Header.value">Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36</stringProp>
          </elementProp>
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">text/plain</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL_1" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL_1</stringProp>
            <stringProp name="Argument.value">api.segment.io</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <boolProp name="HTTPSampler.image_parser">true</boolProp>
        <boolProp name="HTTPSampler.concurrentDwn">true</boolProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <DNSCacheManager guiclass="DNSCachePanel" testclass="DNSCacheManager" testname="DNS Cache Manager" enabled="true">
        <collectionProp name="DNSCacheManager.servers"/>
        <boolProp name="DNSCacheManager.clearEachIteration">true</boolProp>
        <boolProp name="DNSCacheManager.isCustomResolver">false</boolProp>
      </DNSCacheManager>
      <hashTree/>
      <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
        <collectionProp name="AuthManager.auth_list"/>
        <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
      </AuthManager>
      <hashTree/>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">true</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>
      <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="HTTP Cache Manager" enabled="true">
        <boolProp name="clearEachIteration">true</boolProp>
        <boolProp name="useExpires">false</boolProp>
        <boolProp name="CacheManager.controlledByThread">false</boolProp>
      </CacheManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">0</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Test" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="https://api.segment.io/v1/t" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;timestamp&quot;:&quot;2020-07-31T16:18:52.765Z&quot;,&quot;integrations&quot;:{},&quot;context&quot;:{&quot;page&quot;:{&quot;path&quot;:&quot;/&quot;,&quot;referrer&quot;:&quot;&quot;,&quot;search&quot;:&quot;&quot;,&quot;title&quot;:&quot;streamlit_app Â· Streamlit&quot;,&quot;url&quot;:&quot;http://localhost:8501/&quot;},&quot;userAgent&quot;:&quot;Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36&quot;,&quot;locale&quot;:&quot;en-GB&quot;,&quot;library&quot;:{&quot;name&quot;:&quot;analytics.js&quot;,&quot;version&quot;:&quot;3.13.6&quot;}},&quot;properties&quot;:{&quot;reportHash&quot;:&quot;d0608cb&quot;,&quot;dev&quot;:false,&quot;source&quot;:&quot;browser&quot;,&quot;streamlitVersion&quot;:&quot;0.64.0&quot;},&quot;event&quot;:&quot;updateReport&quot;,&quot;messageId&quot;:&quot;ajs-2d88f163f8f8d019af6654c0237eb843&quot;,&quot;anonymousId&quot;:&quot;53d83ab6-70be-4de8-9488-f6f090d6f99d&quot;,&quot;type&quot;:&quot;track&quot;,&quot;writeKey&quot;:&quot;iCkMy7ymtJ9qYzQRXkQpnAJEq7D4NyMU&quot;,&quot;userId&quot;:&quot;7daee856-5cbd-5368-ace3-bc77a9f1147c&quot;,&quot;sentAt&quot;:&quot;2020-07-31T16:18:52.767Z&quot;,&quot;_metadata&quot;:{&quot;bundled&quot;:[&quot;Segment.io&quot;],&quot;unbundled&quot;:[]}}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${BASE_URL_1}</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">v1/t</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="https://api.segment.io/v1/t" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;timestamp&quot;:&quot;2020-07-31T16:18:52.857Z&quot;,&quot;integrations&quot;:{},&quot;context&quot;:{&quot;page&quot;:{&quot;path&quot;:&quot;/&quot;,&quot;referrer&quot;:&quot;&quot;,&quot;search&quot;:&quot;&quot;,&quot;title&quot;:&quot;streamlit_app Â· Streamlit&quot;,&quot;url&quot;:&quot;http://localhost:8501/&quot;},&quot;userAgent&quot;:&quot;Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36&quot;,&quot;locale&quot;:&quot;en-GB&quot;,&quot;library&quot;:{&quot;name&quot;:&quot;analytics.js&quot;,&quot;version&quot;:&quot;3.13.6&quot;}},&quot;properties&quot;:{&quot;sidebar&quot;:2,&quot;markdown&quot;:2,&quot;selectbox&quot;:1,&quot;main&quot;:4,&quot;radio&quot;:1,&quot;textInput&quot;:1,&quot;button&quot;:1,&quot;reportHash&quot;:&quot;d0608cb&quot;,&quot;dev&quot;:false,&quot;source&quot;:&quot;browser&quot;,&quot;streamlitVersion&quot;:&quot;0.64.0&quot;},&quot;event&quot;:&quot;deltaStats&quot;,&quot;messageId&quot;:&quot;ajs-5fa9886981a38f7da4abb3b8dd1627ae&quot;,&quot;anonymousId&quot;:&quot;53d83ab6-70be-4de8-9488-f6f090d6f99d&quot;,&quot;type&quot;:&quot;track&quot;,&quot;writeKey&quot;:&quot;iCkMy7ymtJ9qYzQRXkQpnAJEq7D4NyMU&quot;,&quot;userId&quot;:&quot;7daee856-5cbd-5368-ace3-bc77a9f1147c&quot;,&quot;sentAt&quot;:&quot;2020-07-31T16:18:52.859Z&quot;,&quot;_metadata&quot;:{&quot;bundled&quot;:[&quot;Segment.io&quot;],&quot;unbundled&quot;:[]}}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${BASE_URL_1}</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">v1/t</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="https://api.segment.io/v1/t" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;timestamp&quot;:&quot;2020-07-31T16:18:53.974Z&quot;,&quot;integrations&quot;:{},&quot;context&quot;:{&quot;page&quot;:{&quot;path&quot;:&quot;/&quot;,&quot;referrer&quot;:&quot;&quot;,&quot;search&quot;:&quot;&quot;,&quot;title&quot;:&quot;streamlit_app Â· Streamlit&quot;,&quot;url&quot;:&quot;http://localhost:8501/&quot;},&quot;userAgent&quot;:&quot;Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36&quot;,&quot;locale&quot;:&quot;en-GB&quot;,&quot;library&quot;:{&quot;name&quot;:&quot;analytics.js&quot;,&quot;version&quot;:&quot;3.13.6&quot;}},&quot;properties&quot;:{&quot;reportHash&quot;:&quot;d0608cb&quot;,&quot;dev&quot;:false,&quot;source&quot;:&quot;browser&quot;,&quot;streamlitVersion&quot;:&quot;0.64.0&quot;},&quot;event&quot;:&quot;updateReport&quot;,&quot;messageId&quot;:&quot;ajs-0e047e91446ae6dbbdf35d91e207ad28&quot;,&quot;anonymousId&quot;:&quot;53d83ab6-70be-4de8-9488-f6f090d6f99d&quot;,&quot;type&quot;:&quot;track&quot;,&quot;writeKey&quot;:&quot;iCkMy7ymtJ9qYzQRXkQpnAJEq7D4NyMU&quot;,&quot;userId&quot;:&quot;7daee856-5cbd-5368-ace3-bc77a9f1147c&quot;,&quot;sentAt&quot;:&quot;2020-07-31T16:18:53.976Z&quot;,&quot;_metadata&quot;:{&quot;bundled&quot;:[&quot;Segment.io&quot;],&quot;unbundled&quot;:[]}}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${BASE_URL_1}</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">v1/t</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="https://api.segment.io/v1/t" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;timestamp&quot;:&quot;2020-07-31T16:18:54.120Z&quot;,&quot;integrations&quot;:{},&quot;context&quot;:{&quot;page&quot;:{&quot;path&quot;:&quot;/&quot;,&quot;referrer&quot;:&quot;&quot;,&quot;search&quot;:&quot;&quot;,&quot;title&quot;:&quot;streamlit_app Â· Streamlit&quot;,&quot;url&quot;:&quot;http://localhost:8501/&quot;},&quot;userAgent&quot;:&quot;Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36&quot;,&quot;locale&quot;:&quot;en-GB&quot;,&quot;library&quot;:{&quot;name&quot;:&quot;analytics.js&quot;,&quot;version&quot;:&quot;3.13.6&quot;}},&quot;properties&quot;:{&quot;sidebar&quot;:2,&quot;markdown&quot;:3,&quot;selectbox&quot;:1,&quot;main&quot;:5,&quot;radio&quot;:1,&quot;textInput&quot;:1,&quot;button&quot;:1,&quot;reportHash&quot;:&quot;d0608cb&quot;,&quot;dev&quot;:false,&quot;source&quot;:&quot;browser&quot;,&quot;streamlitVersion&quot;:&quot;0.64.0&quot;},&quot;event&quot;:&quot;deltaStats&quot;,&quot;messageId&quot;:&quot;ajs-bac6d495a309ab08dbc3a61e005ff2ab&quot;,&quot;anonymousId&quot;:&quot;53d83ab6-70be-4de8-9488-f6f090d6f99d&quot;,&quot;type&quot;:&quot;track&quot;,&quot;writeKey&quot;:&quot;iCkMy7ymtJ9qYzQRXkQpnAJEq7D4NyMU&quot;,&quot;userId&quot;:&quot;7daee856-5cbd-5368-ace3-bc77a9f1147c&quot;,&quot;sentAt&quot;:&quot;2020-07-31T16:18:54.121Z&quot;,&quot;_metadata&quot;:{&quot;bundled&quot;:[&quot;Segment.io&quot;],&quot;unbundled&quot;:[]}}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${BASE_URL_1}</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">v1/t</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="https://api.segment.io/v1/m" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;series&quot;:[{&quot;type&quot;:&quot;Counter&quot;,&quot;metric&quot;:&quot;analytics_js.invoke&quot;,&quot;value&quot;:1,&quot;tags&quot;:{&quot;method&quot;:&quot;track&quot;}},{&quot;type&quot;:&quot;Counter&quot;,&quot;metric&quot;:&quot;analytics_js.integration.invoke&quot;,&quot;value&quot;:1,&quot;tags&quot;:{&quot;method&quot;:&quot;track&quot;,&quot;integration_name&quot;:&quot;Segment.io&quot;}}]}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${BASE_URL_1}</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">v1/m</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>